import { Text, View } from "@tarojs/components";
import './index.less'

export default () => {
  // ----------------------常量-------------------------
  // ----------------------生命周期----------------------
  // ----------------------响应函数----------------------
  // ----------------------渲染函数----------------------
  return (
    <View className='index' >
      <View className="title">用户协议和隐私政策</View>
      <View className="content">您在使用我们服务时(如进行找工作、招聘)，我们可能会收集和使用您的相关信息。我们希望通过《可依招聘隐私政策》(以下简称“本隐私政策”)帮助您了解我们会收集哪些信息、为什么收集这些信息，会利用这些信息做些什么及如何保护这些信息。了解这些内容对于您行使隐私权及保护您的个人信息至关重要。 请您在使用我们服务前仔细阅读此《可依招聘隐私政策》(尤其是字体加粗及下划线的内容)并充分理解本隐私政策的全部内容，确定了解我们对您个人信息的处理规则。阅读过程中，如您有任何疑问，可联系我们进行咨询;一旦您继续访问或使用可依招聘，即表示您同意此等隐私政策，授权并接受我们按照本隐私政策的规定收集、保存、使用、共享、披露您的信息。如您不同意协议中的任何条款，请立即停止访问可依招聘及使用相关服务。</View>
      <View className="content">本隐私政策适用于您通过任何方式(包括但不限于APP、微信小程序等)对可依招聘各项服务的访问和使用。另外，若您通过使用第三方产品和/或服务(如第三方账号)来使用可依招聘的服务，您的信息还应当适用该第三方的隐私政策。</View>
      <View className="littleTitle">一、个人信息的收集及用途</View>
      <View className="content">根据国家法律法规的规定，网络运营者为用户提供信息发布、即时通讯等服务，在与用户签订协议或者确认提供服务时，应当要求用户提供真实身份信息。用户不提供真实身份信息的，网络运营者不得为其提供相关服务。为了符合法律法规要求并更好地为您提供服务，我们将收集并使用您的个人信息。我们承诺将坚持“最小必要化”原则收集、使用、存储和传输用户信息，并通过用户协议和隐私政策告知您相关信息的使用目的和范围。</View>
      <View className="content">（ 一 ）个人信息的定义</View>
      <View className="content">个人信息，是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，在本隐私政策中涉及的个人信息包括但不限于:
      </View>
      <View className="content">
        基本信息:包括个人姓名、年龄(生日)、性别、个人电话号码、行业、工作经历、职业技能、所属公司等;
        个人身份信息：个人证件、面部特征等;
        账号信息：包括系统账号、IP地址、邮箱地址及与前述有关的密码等;
        个人上网记录：包括小程序登录记录、浏览记录、使用记录、点击记录、操作记录等;
        个人常用设备信息：包括硬件型号、设备 MAC 地址、操作系统类型、设备识别码等;
        个人位置信息：包括定位信息等。
        个人聊天记录：您作为求职者/招聘者，与您的相对方通过在线沟通功能所发送的信息。
      </View>
      <View className="content">（ 二 ）为使用服务用户须提供并授权平台收集、使用的信息</View>
      <View className="content">
        在您使用平台服务以及具体功能的过程中，我们可能会收集、保存和使用下列与您有关的信息才能提供上述服务。如果您不提供相关信息，您将无法使用平台的服务/具体功能。请您注意，您在使用平台服务/功能时所提供的所有个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在您使用我们的产品与/或服务期间持续授权我们使用。这些服务/功能包括但不限于:
      </View>
      <View className="content">1. 用户注册</View>
      <View className="content">当您注册时，您需要至少向我们提供您本人的手机号码用于注册账号，我们将通过发送短信验证码的方式来验证您的身份是否有效。您可以自主设置您的账户密码，并补充个人基本信息包括用户名、个人姓名、性别、年龄、行业、工作经历、职业技能、所属公司以及相关信息等。这些信息均属于您的“账户信息”，您补充的账户信息将有助于我们为您提供个性化求职或招聘体验等。
        请注意，您作为企事业单位或组织的招聘人员进行招聘者身份注册时，需要提供您的个人身份信息，包括但不限于身份证和/或其他辅助证件(如名片、工牌等)，并进行实名认证(具体要求以注册页面的指示为准);另外，还需提供您所属的公司信息。如您不能或拒绝提供上述信息，将无法以招聘者身份完成注册。</View>
      <View className="content">2. 找工作</View>
      <View className="content">为了更好的为您匹配并推荐职位信息并让企业招聘负责人更好地发现您，我们将收集您的基本信息、个人上网记录、个人位置信息等。通过收集这些信息，平台将为您推荐更符合您的职位(例如与您所在城市、所在行业相匹配的职位)。
        关于简历：由于本平台是连接候选人与用人者的中介信息平台及职业社区，如您作为求职者，您必须先完善您的个人在线简历后方可投递本网站上招聘企业发布的职位。个人在线简历包含前述个人基本信息以及其他因找工作所需提供的信息。当您向平台上传附件简历或编辑在线简历，并选择了公开您的简历时，您已经同意使用平台相应服务的招聘单位(及人员)可以通过我们的系统功能(如职位、行业、从业时间等关键词)发现您。购买了相应服务的招聘企业(及人员)拥有法律上许可的对您的简历进行查询、浏览、下载、使用、存储的权利;对于因此而引起的任何法律纠纷(包括但不限于招聘企业或人员错误或非法使用前述简历信息)，本平台不承担任何法律责任。</View>
      <View className="content">3. 招聘</View>
      <View className="content">您在代表公司注册招聘人员账号并入驻平台时提交的相应资质材料，并不属于您的个人信息，而是用于证明企业的资质及企业真实招聘需求。您作为企业招聘人员代表企业在平台上提供的信息及使用平台所产生的信息，企业均有权向平台申请获取或查看上述信息。</View>
      <View className="content">3. 招聘</View>
      <View className="content">您在代表公司注册招聘人员账号并入驻平台时提交的相应资质材料，并不属于您的个人信息，而是用于证明企业的资质及企业真实招聘需求。您作为企业招聘人员代表企业在平台上提供的信息及使用平台所产生的信息，企业均有权向平台申请获取或查看上述信息。</View><View className="content">4. 沟通功能</View>
      <View className="content">平台为招聘企业及候选人之间提供了在线沟通的功能，为此平台需要使用双方的账号信息等。</View>
      <View className="content">5. 客服功能</View>
      <View className="content">您在使用服务的过程中，可能会向客服渠道提出任何问题、意见、建议、投诉、举报等需求。为此我们需收集、使用上述个人信息中的(部分/全部)相关内 容。有关向第三方披露、共享您的个人信息的情况，将遵循下文中的具体约定。</View>
      <View className="content">（ 三 ）改进产品与/或服务所必须的功能</View>
      <View className="content">1. 个性化的推荐:当您登录平台的网页或使用平台 APP 时，我们的服务器会自动记录您的日志信息，例如您的登录记录、输入的搜索关键词信息、点击的内容，您发布的报错信息、反馈和评论信息，您上传的图片信息、您的 IP 地址、硬件设备信息、您访问服务的日期、时间、时长等。为了给您带来更便捷的服务，我们可能会收集您设备上的信息并进行本地存储。我们会基于前述信息以及您的收藏数据(例 如您作为求职者收藏的招聘企业、职位以及您作为企业招聘人员收藏的候选人等)对您的偏好、习惯、位置作特征分析和用户画像，以便为您提供更适合您的定制化服务，例如向您展现或推荐相关程度更高(而非普遍推送)的展示结果、搜索结果、信息流或者推广信息结果。 2. 产品功能改进:为了监测广告投放情况、改进产品BUG、优化产品的稳定性及功能性等目的，我们提供部分功能和/或服务时需要使用第三方SDK技术。这些第三方SDK可能会收集或使用您的部分个人信息/设备权限（包括但不限于下列列表），我们会以弹窗等提示等明示方式授权，只有在您授权同意后才会获取相关信息。如第三方SDK的数量、收集或使用的个人信息/设备权限范围有所变更的，我们将会通过弹窗或其他形式取得您的授权。</View>
      <View className="content">（ 四 ）关于未成年人个人信息的处理</View>
      <View className="content">由于本平台是连接候选人与用人者的中介信息平台及职业社区，根据国家劳动相关法律法规以及平台用户协议，您必须是十六周岁以上方可注册平台账号。
        如果您是以自己劳动收入为主要生活来源的十六周岁以上的未成年人，则您有完全民事行为能力，您与平台之前的关系完全适用本隐私政策。
        如果您不是以自己的劳动收入为主要来源的十六周岁以上的未成年人，您仍然需要在监护人同意及监督下使用我们的产品。平台会在受到法律允许、监护人明确同意或者保护未成年人所必要的情况下收集、使用或公开披露您的个人信息。</View>
      <View className="content">（ 五 ）隐私政策的更新</View>
      <View className="content">随着平台经营的发展，本隐私政策将不时更新。我们会通过在网站公告、APP端推送、电子邮件等其他适当方式提醒您相关内容的更新。你也可以随时访问我们的隐私政策页面来获知最新版本。
        对于重大变更（我们收集和使用您个人信息方式的变化将导致您的权利实质性的减少或义务的实质性增多）我们会采用更为显著的通知方式。
        在您收到上述更新后，请您仔细阅读详细内容，如您不同意隐私政策的更新，系统将为您登出账号，但您仍然可以在未登录的情况下使用部分基本功能。</View>
      <View className="content">（ 六 ）联系我们</View>
      <View className="content">关于本隐私政策及个人信息的任何问题（包括反馈、建议、投诉、举报等），您可以通过产品的在线反馈功能或如下方式同我们联系。
        <View>邮箱：<Text className="email">workhardcl@icloud.com</Text>。</View>
      </View>
    </View>
  )
}
